for res_item in res:
    for term, docs in res_item:
        doc_str = '-'
        len_str = '-'
        varss = ''
        if docs != None:
            
                
            doc_str = len(docs) < 4 and docs or docs[:3]
            len_str = '{}'.format(len(docs))
            varss = [c_raw[doc][3] for doc in docs][:3]
            
        print('{} [{}] {}'.format(term, len_str, varss))
    print('\n\n')

"""
bayer [18] ['БАЙЕР ШЕРИНГ ФАРМА', 'БАЙЕР', 'БАЙЕР БИТТЕРФЕЛЬД']
pharma [249] ['АУКТУС ФАРМА', 'МЕДИЦЕ ФАРМА', 'РАШМИ ФАРМА']
ag [71] ['ССЛ БЕХРИНГ', 'БАЙЕР ШЕРИНГ ФАРМА', 'ПРОТО КЕМИКАЛС']



bayer [18] ['БАЙЕР ШЕРИНГ ФАРМА', 'БАЙЕР', 'БАЙЕР БИТТЕРФЕЛЬД']
pharma [249] ['АУКТУС ФАРМА', 'МЕДИЦЕ ФАРМА', 'РАШМИ ФАРМА']
ag [71] ['ССЛ БЕХРИНГ', 'БАЙЕР ШЕРИНГ ФАРМА', 'ПРОТО КЕМИКАЛС']



bayer [18] ['БАЙЕР ШЕРИНГ ФАРМА', 'БАЙЕР', 'БАЙЕР БИТТЕРФЕЛЬД']
pharma [249] ['АУКТУС ФАРМА', 'МЕДИЦЕ ФАРМА', 'РАШМИ ФАРМА']
ag [71] ['ССЛ БЕХРИНГ', 'БАЙЕР ШЕРИНГ ФАРМА', 'ПРОТО КЕМИКАЛС']
"""
